[Channeler X2UniversalSoldierClassInfo]
ClassSpecializationTitle="通灵人"
ClassSpecializationSummary="作为一名具有精神天赋的士兵，通灵人专注于将他们的思想向外转移，使用他们的精神天赋进行进攻."

[Resonant X2UniversalSoldierClassInfo]
ClassSpecializationTitle="共振者"
ClassSpecializationSummary="作为一名具有精神天赋的士兵，共振者专注于将他们的思想转向内在，利用他们的精神天赋来保护自己和他们的盟友的安全."

[Telepath X2UniversalSoldierClassInfo]
ClassSpecializationTitle="心灵感应者"
ClassSpecializationSummary="作为一名具有精神天赋的士兵，心灵感应者专注于将他们的思想向外转移，利用他们的精神天赋来控制敌人的思想."